Repository: ElluIFX/Glance
Catalog: src/Glance.Components/Executable/Resources/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Component.DisplayName
source: Executable file information
zh_cn: 可执行文件信息

# Status.Available
source: Inspect PE files without executing them
zh_cn: 静态查看 PE 文件信息

# Preview.Loading
source: Loading executable information...
zh_cn: 正在读取可执行文件信息...

source: Overview
zh_cn: 概要

source: Signatures
zh_cn: 签名

# Imports
source: Dependencies
zh_cn: 依赖

source: Exports
zh_cn: 导出

source: Resources
zh_cn: 资源

# Structure
source: PE structure
zh_cn: PE 结构

# Search
source: Search this section
zh_cn: 搜索当前分类

# Report
source: Export report
zh_cn: 导出报告

source: Save resource
zh_cn: 导出资源

# Hash
source: Calculate SHA-256
zh_cn: 计算 SHA-256

# Verify
source: Verify signature
zh_cn: 验证签名

source: Reload
zh_cn: 重新加载

# Basic
source: Basic information
zh_cn: 基本信息

# Runtime
source: Runtime and permissions
zh_cn: 运行与权限

source: File
zh_cn: 文件

source: Description
zh_cn: 描述

source: Product
zh_cn: 产品

source: File version
zh_cn: 文件版本

source: Product version
zh_cn: 产品版本

# Company
source: Company (declared)
zh_cn: 公司（文件声明）

# Original
source: Original filename
zh_cn: 原始文件名

source: Copyright
zh_cn: 版权

source: Architecture
zh_cn: 架构

source: Type
zh_cn: 类型

source: Subsystem
zh_cn: 子系统

source: Size
zh_cn: 大小

source: Name
zh_cn: 名称

source: Value
zh_cn: 值

source: Ordinal
zh_cn: 序号

source: Forwarder
zh_cn: 转发目标

# Delay
source: Delay load
zh_cn: 延迟加载

# Direct
source: Direct import
zh_cn: 直接导入

source: Language
zh_cn: 语言

# Offset
source: File offset
zh_cn: 文件偏移

source: Virtual size
zh_cn: 虚拟大小

source: Flags
zh_cn: 标志

# Entry
source: Entry point
zh_cn: 入口点

# Base
source: Image base
zh_cn: 映像基址

# Timestamp
source: PE timestamp
zh_cn: PE 时间戳

# Linker
source: Linker version
zh_cn: 链接器版本

# Alignment
source: File / section alignment
zh_cn: 文件 / 节区对齐

source: Native
zh_cn: 原生

source: Assembly
zh_cn: 程序集

# References
source: Assembly references
zh_cn: 程序集引用

source: Version
zh_cn: 版本

source: Culture
zh_cn: 区域性

# Token
source: Public key token
zh_cn: 公钥标记

# Framework
source: Target framework
zh_cn: 目标框架

# Metadata
source: Metadata version
zh_cn: 元数据版本

source: None
zh_cn: 无

source: Unknown
zh_cn: 未知

source: Loading...
zh_cn: 正在加载...

# Empty
source: No entries
zh_cn: 无条目

# Error
source: Unable to read this section
zh_cn: 无法读取此分类

# Partial
source: Partial results — parsing limit reached
zh_cn: 部分结果：已达到解析限制

# Changed
source: The file changed; reload to continue
zh_cn: 文件已变化，请重新加载

# Invalid
source: Invalid or unsupported PE file
zh_cn: 无效或不支持的 PE 文件

source: Cancelled
zh_cn: 已取消

source: Not loaded
zh_cn: 未加载

source: Complete
zh_cn: 完整

# Unsigned
source: No signature found
zh_cn: 未找到签名

# Offline
source: Offline verification
zh_cn: 离线验证

# Trusted
source: Verified using local trust data
zh_cn: 已通过本机信任验证

# Unverified
source: Offline verification incomplete
zh_cn: 离线验证未完成

# InvalidSignature
source: Signature verification failed
zh_cn: 签名验证失败

source: Signer
zh_cn: 签名者

source: Issuer
zh_cn: 颁发者

source: Subject
zh_cn: 主体

source: Valid from
zh_cn: 有效期起始

source: Valid until
zh_cn: 有效期截止

# Integrity
source: Integrity and trust
zh_cn: 完整性与信任

source: Revocation
zh_cn: 吊销状态

# CacheOnly
source: Local cache only
zh_cn: 仅使用本机缓存

# Embedded
source: Embedded signature
zh_cn: 内嵌签名

# Catalog
source: Catalog signature
zh_cn: 目录签名

# Algorithm
source: Digest algorithm
zh_cn: 摘要算法

# Permission
source: Execution level
zh_cn: 执行权限

# Dpi
source: DPI awareness
zh_cn: DPI 感知

# LongPath
source: Long path support
zh_cn: 长路径支持

# Compatibility
source: Declared compatibility
zh_cn: 兼容性声明

source: Yes
zh_cn: 是

source: No
zh_cn: 否

# PreviewLimit
source: Preview limited; export to obtain all bytes
zh_cn: 预览长度受限，可导出完整数据

# ReportTitle
source: Executable information
zh_cn: 可执行文件信息

# SaveFailed
source: Unable to save the file
zh_cn: 无法保存文件

# HashPending
source: Not calculated
zh_cn: 未计算

source: All files
zh_cn: 所有文件

source: Raw resource
zh_cn: 原始资源

source: Section
zh_cn: 分类

# State
source: Status
zh_cn: 状态

# Count
source: Entries
zh_cn: 条目

# ResourceHint
source: Select a resource to inspect its contents
zh_cn: 选择资源查看内容

# Security
source: Declared mitigations
zh_cn: 安全声明标志

source: Certificate
zh_cn: 证书

source: File summary
zh_cn: 文件摘要

source: All entries
zh_cn: 全部条目

source: Signing time
zh_cn: 签名时间

source: Cursor
zh_cn: 光标

source: Bitmap
zh_cn: 位图

source: Icon
zh_cn: 图标

source: String table
zh_cn: 字符串表

source: Cursor group
zh_cn: 光标组

source: Icon group
zh_cn: 图标组

source: Version resource
zh_cn: 版本资源

source: Cancel
zh_cn: 取消

# Summary_Library
source: Library capabilities
zh_cn: 库提供的能力

# Summary_Program
source: Program contents
zh_cn: 程序内容

# Summary_ExportCount
source: Exported interfaces
zh_cn: 导出接口数量

# Summary_Interfaces
source: Representative interfaces
zh_cn: 代表性接口

# Summary_PublicTypes
source: Public types
zh_cn: 公开类型

# Summary_Dependencies
source: Main dependencies
zh_cn: 主要依赖

# Summary_Icons
source: Icon groups
zh_cn: 图标组

# Summary_Dialogs
source: Dialog resources
zh_cn: 对话框资源

# Summary_Strings
source: String tables
zh_cn: 字符串表

# Summary_Embedded
source: Embedded data resources
zh_cn: 内嵌数据资源

# Summary_ExportEvidence
source: Capabilities indicated by exported interface names
zh_cn: 根据导出接口名称归纳的能力线索

# Summary_ImportEvidence
source: Content clues from referenced interfaces
zh_cn: 根据引用接口归纳的内容线索

# Summary_NoDetails
source: No additional content information
zh_cn: 没有更多可用的内容信息

# Capability_Image
source: Image processing interfaces
zh_cn: 图像处理接口

# Capability_Media
source: Audio and video interfaces
zh_cn: 音视频处理接口

# Capability_Archive
source: Compression interfaces
zh_cn: 压缩处理接口

# Capability_Database
source: Database interfaces
zh_cn: 数据库接口

# Capability_Network
source: Networking interfaces
zh_cn: 网络通信接口

# Capability_Graphics
source: Graphics interfaces
zh_cn: 图形渲染接口

# Capability_Python
source: Python interfaces
zh_cn: Python 接口

# Capability_Com
source: COM component interfaces
zh_cn: COM 组件接口

# Capability_Service
source: Windows service interfaces
zh_cn: Windows 服务接口

source: Show full information
zh_cn: 显示完整信息

source: Back to summary
zh_cn: 返回摘要

source: No entries
zh_cn: 无条目

# ManagedTypes
source: .NET types
zh_cn: .NET 类型

# ManagedMethods
source: .NET methods
zh_cn: .NET 方法

# ManagedFields
source: .NET fields
zh_cn: .NET 字段

# BaseType
source: Base type metadata token
zh_cn: 基类型元数据标记

source: Implementation flags
zh_cn: 实现标志

# SignatureBlob
source: Type signature bytes
zh_cn: 类型签名字节

source: Parameters
zh_cn: 参数

source: Metadata token
zh_cn: 元数据标记

source: Public type
zh_cn: 公开类型
